// 专项题
export const questions = {
  // 闪耀
  shine: [
    {
      title: '走过星光大道，突然大家都看向你，你的第一反应是？',
      answers: [
        {
          desc: 'A：伦家就是这条街上最靓的仔',
          score: {
            shine: 20,
            repair: 0,
            born: 10
          }
        },
        {
          desc: 'B：是妆容花了吗？赶紧照镜子看看',
          score: {
            shine: 10,
            repair: 10,
            born: 0
          }
        },
        {
          desc: 'C：为了缓解尴尬，假装看手机走过',
          score: {
            shine: 15,
            repair: 5,
            born: 5
          }
        }
      ]
    },
    {
      title: '恭喜你成为赫莲娜精品店的第10000名顾客，作为幸运鹅大礼，如果赠与你一种终极福利卡你会选择？',
      answers: [
        {
          desc: 'A：男神女神爱上我之魅力满分卡',
          score: {
            shine: 20,
            repair: 0,
            born: 5
          }
        },
        {
          desc: 'B：热门新品单次畅享卡',
          score: {
            shine: 10,
            repair: 10,
            born: 5
          }
        },
        {
          desc: 'C：友谊情比金坚他人代付卡',
          score: {
            shine: 10,
            repair: 5,
            born: 10
          }
        }
      ]
    }
  ],

  // 修复
  repair: [
    {
      title: '走过星光大道，面前一个男子着急地跑过，他要去干嘛呢？',
      answers: [
        {
          desc: 'A：女友约会快迟到了，求生欲爆棚',
          score: {
            shine: 5,
            repair: 20,
            born: 0
          }
        },
        {
          desc: 'B：聚会赶场，晚了要罚三杯的',
          score: {
            shine: 5,
            repair: 15,
            born: 5
          }
        },
        {
          desc: 'C：BOSS的呼唤，加班使人快乐',
          score: {
            shine: 0,
            repair: 20,
            born: 5
          }
        }
      ]
    },
    {
      title: '来到赫莲娜精品店，为了参加前任的婚礼，你打算好好地精心准备一份“大礼”',
      answers: [
        {
          desc: 'A：要想生活过得去，不如送TA绿宝瓶',
          score: {
            shine: 5,
            repair: 15,
            born: 5
          }
        },
        {
          desc: 'B：治愈失恋悲伤，全靠黑绷带。',
          score: {
            shine: 0,
            repair: 15,
            born: 10
          }
        },
        {
          desc: 'C：今天的我你高攀不起之高光精华 ',
          score: {
            shine: 10,
            repair: 5,
            born: 0
          }
        }
      ]
    }
  ],

  // 新生
  born: [
    {
      title: '星光大道走到一半时，突然响起一段BGM，这段音乐给你的感觉是？',
      answers: [
        {
          desc: 'A：高山流水哗啦啦',
          score: {
            shine: 0,
            repair: 10,
            born: 15
          }
        },
        {
          desc: 'B：水龙头没关好',
          score: {
            shine: 5,
            repair: 0,
            born: 20
          }
        },
        {
          desc: 'C：美人鱼在玩耍',
          score: {
            shine: 0,
            repair: 5,
            born: 20
          }
        }
      ]
    },
    {
      title: '一踏进赫莲娜精品店，便收到发工资的短信，开心之余你决定：',
      answers: [
        {
          desc: 'A：千金难买我高兴，吃完土下个月还是条好汉',
          score: {
            shine: 5,
            repair: 0,
            born: 20
          }
        },
        {
          desc: 'B：出来逛迟早是要买的，挑最想要的买就好了',
          score: {
            shine: 5,
            repair: 5,
            born: 15
          }
        },
        {
          desc: 'C：迅速计算房租伙食费狗粮费，算了下次再买',
          score: {
            shine: 0,
            repair: 10,
            born: 15
          }
        }
      ]
    }
  ]
}

// 常规题
export const regularQues = [
  // 艺术馆
  {
    title: '来到赫莲娜的艺术收藏馆，你正沉浸在世界上最精美的艺术珍藏里，眼前的肖像突然开口说话了，你觉得他会说什么？',
    answers: [
      {
        desc: '游泳健身了解一下。',
        score: {
          shine: 0,
          repair: 5,
          born: 20
        }
      },
      {
        desc: '糟了，是心动的感觉！',
        score: {
          shine: 20,
          repair: 0,
          born: 5
        }
      },
      {
        desc: '不好意思，你挡住我视线了。',
        score: {
          shine: 5,
          repair: 15,
          born: 5
        }
      }
    ]
  },
  // 实验室
  {
    title: '赫莲娜的实验室里，有几瓶“恋人”药水，如果是你，你想调配出哪一种理想恋人？',
    answers: [
      {
        desc: '带金丝眼镜小清新文艺的TA',
        score: {
          shine: 5,
          repair: 15,
          born: 0
        }
      },
      {
        desc: '街舞电竞样样行的潮酷BOY/GIRLs',
        score: {
          shine: 0,
          repair: 15,
          born: 0
        }
      },
      {
        desc: '温柔体贴会过日子的经济适用型伴侣',
        score: {
          shine: 0,
          repair: 10,
          born: 10
        }
      }
    ]
  },
  // 美发沙龙
  {
    title: '欢迎来到赫莲娜女士1902年开创的世界第一家美容沙龙“Valaze”。在完美蜕变成全世界的焦点前，你想发表什么样的感言？',
    answers: [
      {
        desc: '躺赢人生，易如反掌。',
        score: {
          shine: 20,
          repair: 0,
          born: 0
        }
      },
      {
        desc: '经得住多少诋毁，我就收得下多少赞美。',
        score: {
          shine: 0,
          repair: 20,
          born: 0
        }
      },
      {
        desc: '好嗨哟，感觉人生到达了巅峰。',
        score: {
          shine: 0,
          repair: 10,
          born: 20
        }
      }
    ]
  }
]

// 结果分析, 分为极致属性 + 普通属性
export const extra = {
  shine: [
    {
      title: '自带强光的新星少女',
      desc: '不定时照亮天际，常令人怀疑是UFO'
    },
    {
      title: '奥斯卡戏精小金人',
      desc: '戏多不压身，演技时刻在线'
    },
    {
      title: '高能发光锦鲤',
      desc: '对blingbling的东西抵抗力为0，被当做好运的象征'
    }
  ],
  repair: [
    {
      title: '熬夜金牌获得者',
      desc: '蹦最养生的迪，熬最晚的夜'
    },
    {
      title: '情绪稳定的成年人',
      desc: '再憋屈也不会挂在脸上，忍者一样的存在'
    },
    {
      title: '云恋爱痴情少女',
      desc: '追星一时爽，一直追星一直爽'
    }
  ],
  born: [
    {
      title: '白日梦艺术家',
      desc: '好看的皮囊你养不起，有趣的灵魂一两百斤'
    },
    {
      title: '异想天开协会会长',
      desc: '长得美，想得更美'
    },
    {
      title: '才华有限公司CEO',
      desc: '才华制造机，常人难以跟上的脑洞'
    }
  ]
}

export const normal = {
  shine: {
    '0~30': [
      '我只是路过的无辜吃瓜群众',
      '高冷不粘人，间歇性需要独处',
      '擅长独行，常常感到和人类格格不入'
    ],
    '31~70': [
      '不喜欢说教，吃软不吃硬',
      '停止散发魅力吧你这迷人的家伙',
      '异常甜美，方圆5米以内的异性难以抗拒'
    ],
    '70~100': [
      '不闪耀会死星人，叫我女王殿下',
      '明明有颜值，偏要靠实力',
      '喜欢成为众星捧月的焦点，否则会有小情绪'
    ]
  },
  repair: {
    '0~30': [
      '国际退堂鼓殿堂级演奏师，碰到麻烦的事情就会犯困',
      '傲娇易碎品，请注意小心呵护',
      '软萌傻白甜，因此往往运气过人'
    ],
    '31~70': [
      '讨好型社交，如果XXX做出妥协，请好好珍惜',
      '99%的时间脾气很好，但激怒XX的后果自负',
      '外表下藏着粉红色的心，对于不开心的事情记忆力不太好'
    ],
    '70~100': [
      '纠结似处女座，恋爱容不得一点瑕疵',
      '恋爱中小鸟依人，必要时刻会变得异常强大',
      '爱真的需要勇气来面对六眼飞鱼'
    ]
  },
  born: {
    '0~30': [
      '去餐厅只会点同样的菜，习惯就是最强的安全感',
      '不要让XXX去做选择，她会炸毛',
      '网上是话痨，线下社交恐惧'
    ],
    '31~70': [
      '难以束缚，喜欢自由生长',
      '发呆的时候往往会灵魂出窍',
      '没有什么事情是睡一觉不能解决的'
    ],
    '70~100': [
      '职场MVP，没有XX拿不下的案子',
      '碰到难题会激发300%的战斗力',
      '来自火星，思维方式异于常人'
    ]
  }
}

// 精品店
export const boutique = [
  {
    name: 'light',
    desc: '赫莲娜的面霜'
  },
  {
    name: 'banner',
    desc: '赫莲娜的banner'
  },
  {
    name: 'doorCover',
    desc: '赫莲娜的门'
  },
  {
    name: 'cloud',
    desc: '赫莲娜的云彩'
  }
]

// 美术馆 = 艺术馆
export const artMuseum = [
  {
    name: 'book',
    phi: -90,
    theta: -10,
    desc: '赫莲娜一生收集了毕加索、达利、布朗库西等艺术家的作品。她大力支持年轻艺术家，创建了多家艺术基金会，将她的公寓改造成艺廊，并在她的美容沙龙中展览她珍藏的作品。'
  },
  {
    name: 'picture',
    phi: 32,
    theta: 14,
    desc: '赫莲娜·鲁宾斯坦和毕加索早已相识，在她于 1955 年从纽约前往戛纳时，毕加索为她绘制了肖像，根据披露，这位伟大的艺术家一共为她绘制了40幅素描。'
  },
  {
    name: 'mask',
    phi: -153,
    theta: -44,
    desc: '赫莲娜·鲁宾斯坦是收藏非洲面具和雕像的首位重要收藏家。她对如此“丑陋”的雕像情有独钟。而当部落艺术成为时尚时，她所珍藏的作品价值也以 10 倍的速度增长。'
  },
  {
    name: 'dress',
    phi: -153,
    theta: -44,
    desc: '“置身于艺术品之间，能够缓解我对外貌的过度专注。我的艺术收藏是我内心生活的全部。'
  }
]

// 实验室
export const lab = [
  {
    name: 'book',
    phi: -90,
    theta: -10,
    desc: '赫莲娜认为美容与科学之间是相互关联的，在欧洲，她遇到了包括玛丽·居里在内的当时最伟大的科学家，对美容学的认识有了进一步提高，并以科学的方式，将肌肤类型细分（干性、普通、油性）。'
  },
  {
    name: 'equ',
    phi: 32,
    theta: 14,
    desc: '赫莲娜夫人还探索了当时最现代的水疗中心所采用的全新做法：以水疗法调理身体；电击能够引起肌肉收缩，有助于强健体魄；皮肤医学可解决皮肤问题；轻食、按摩和体育锻炼对肌肤有好处。'
  },
  {
    name: 'staff',
    phi: -153,
    theta: -44,
    desc: '赫莲娜意识到美容护理的未来取决于科学。1905 年，她返回欧洲之后，一直与当时最著名的专家待在一起，孜孜不倦地以科学知识充实自己。'
  }
]

// 美容房
export const beautify = [
  {
    name: 'logo',
    phi: -90,
    theta: -10,
    desc: '1902年，赫莲娜在墨尔本市中心的科林斯街243 号开创了世界上第一家美容沙龙，大获成功。随后，赫莲娜萌生了将美容护理、按摩手法、饮食建议和彩妆课程汇聚一堂的想法。'
  },
  {
    name: 'staff',
    phi: 32,
    theta: 14,
    desc: '在与当时领先的皮肤科医生会面后，赫莲娜进一步让自己的美容护肤方法的论述更为科学、系统。她的助理们就变成了首批美容师，学习如何涂抹面膜、进行肌肤诊断、面部和头皮护理。'
  }
]
